export interface InfoBlock {
    title: string
    text: string[]
    src?: string
}

interface Intro {
    title: string
    description: string[]
}

interface Data {
    intro: Intro
    infoBlocks: InfoBlock[]
}

export const data:Data = {
    intro: {
        title: "ПРО СЕРВЕР",
        description: ["Ласкаво просимо на ванільний Minecraft-сервер, де все побудовано навколо класичного виживання, чесної гри та комфортної спільноти. Ми зберегли оригінальний геймплей Minecraft без модифікацій, щоб кожен гравець отримував саме той досвід, який задумали розробники.", "Сервер підходить як для новачків, так і для досвідчених гравців, які цінують стабільність, справедливі правила та живий світ."]
    },
    infoBlocks: [
        {
            title: "ПЕРШИЙ БЛОК",
            text: ["Ласкаво просимо на ванільний Minecraft-сервер, де все побудовано навколо класичного виживання.",],
            src: "/images/image2.png",
        },
        {
            title: "ПЕРШИЙ БЛОК",
            text: ["Ласкаво просимо на ванільний Minecraft-сервер, де все побудовано навколо класичного виживання.", "Ми зберегли оригінальний геймплей Minecraft без модифікацій.", "Ласкаво просимо на ванільний Minecraft-сервер, де все побудовано навколо класичного виживання.", "Ми зберегли оригінальний геймплей Minecraft без модифікацій."],
            src: "/images/image2.png",
        },
        {
            title: "ПЕРШИЙ БЛОК",
            text: ["Ласкаво просимо на ванільний Minecraft-сервер, де все побудовано навколо класичного виживання.", "Ми зберегли оригінальний геймплей Minecraft без модифікацій.", "Ласкаво просимо на ванільний Minecraft-сервер, де все побудовано навколо класичного виживання.", "Ми зберегли оригінальний геймплей Minecraft без модифікацій.", "Ласкаво просимо на ванільний Minecraft-сервер, де все побудовано навколо класичного виживання."],
            src: "/images/image2.png",
        },
        {
            title: "ПЕРШИЙ БЛОК",
            text: ["Ласкаво просимо на ванільний Minecraft-сервер, де все побудовано навколо класичного виживання.", "Ми зберегли оригінальний геймплей Minecraft без модифікацій.", "Ласкаво просимо на ванільний Minecraft-сервер, де все побудовано навколо класичного виживання.", "Ми зберегли оригінальний геймплей Minecraft без модифікацій.", "Ласкаво просимо на ванільний Minecraft-сервер, де все побудовано навколо класичного виживання.", "Ми зберегли оригінальний геймплей Minecraft без модифікацій.", "Ласкаво просимо на ванільний Minecraft-сервер, де все побудовано навколо класичного виживання."],
        }
    ]
}