import slugify from "slugify"
import type { Content} from "@/types/contentType"

export interface INews {
    url: string
    title: string
    description: string // короткий опис
    categories: string[]
    image: string // усюди, де є зображення - це шлях на зображення, напр(/images/house.png)
    content: Content[]
    author: string
    authorIcon: string
    date: number
}

export const news: INews[] = [
    {
        url: slugify("Наш сервер"),
        title: "Наш сервер",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Основне", "Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Історія нашого сервера"),
        title: "Історія нашого сервера",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Основне", "Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Чудовий сервер"),
        title: "Чудовий сервер",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Основне", "Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Ми відкрились"),
        title: "Ми відкрились",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Основне", "Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Новий евент"),
        title: "Новий евент",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Основне", "Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Обрали нового лідера"),
        title: "Обрали нового лідера",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Обрали нового лідера"),
        title: "Обрали нового лідера",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Обрали нового лідера"),
        title: "Обрали нового лідера",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Обрали нового лідера"),
        title: "Обрали нового лідера",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Обрали нового лідера"),
        title: "Обрали нового лідера",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Обрали нового лідера"),
        title: "Обрали нового лідера",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Обрали нового лідера"),
        title: "Обрали нового лідера",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Обрали нового лідера"),
        title: "Обрали нового лідера1",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
    {
        url: slugify("Обрали нового лідера"),
        title: "Обрали нового лідера1",
        description: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов.",
        categories: ["Новини"],
        image: "/images/image2.png",
        content: [
            { type: "paragraph", text: "Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії. Простий, стабільний і затишний світ, у який хочеться повертатися.  Наш сервер — це чиста ваніль, без модів і зайвих надбудов. Тут ти можеш грати з друзями так, як задумано у класичному Minecraft: будувати, виживати, досліджувати та створювати власні історії." },
        ],
        author: "adattoweb",
        authorIcon: "/images/face.png",
        date: 123,
    },
]

export const categoriesMap: Map<string, string> = new Map([ // тут проходить реєстрація усіх категорій + кольорів на них, перший рядок назва, другий кольор
    ["Основне", "#FF2A2A"],
    ["Новини", "#FF5335"],
  ]);