import type { Content} from "@/types/contentType"

interface Rule {
    title: string
    src: string
    content: Content[]
}

export const rules:Rule[] = [
    {
        title: "ЧАТ ТА СПІЛКУВАННЯ 1",
        src: "/images/village.png",
        content: [
            {type: "paragraph", text: "На сервері діють особливі правила, які спрямовані на обмеження швидкості ігрової прогресії та шляхів її досягнення, а саме:"},
            {type: "unorderedlist", items: ["Вхід до Енду заборонений до 04.01.2026" , "Обмеження часу знаходження в Незері становить 20 хв*", "Усі інші умови розміщенні на нашому дискорд сервері та піддаються змінам суспільстві"]},
        ]
    },
    {
        title: "ІГРОВИЙ ПРОЦЕС 2",
        src: "/images/steve.png",
        content: [
            {type: "paragraph", text: "На сервері діють особливі правила, які спрямовані на обмеження швидкості ігрової прогресії та шляхів її досягнення, а саме:"},
            {type: "unorderedlist", items: ["Вхід до Енду заборонений до 04.01.2026" , "Обмеження часу знаходження в Незері становить 20 хв*", "Усі інші умови розміщенні на нашому дискорд сервері та піддаються змінам суспільстві"]},
        ]
    },
    {
        title: "ІГРОВИЙ ПРОЦЕС 3",
        src: "/images/fishing.png",
        content: [
            {type: "paragraph", text: "На сервері діють особливі правила, які спрямовані на обмеження швидкості ігрової прогресії та шляхів її досягнення, а саме:"},
            {type: "unorderedlist", items: ["Вхід до Енду заборонений до 04.01.2026" , "Обмеження часу знаходження в Незері становить 20 хв*", "Усі інші умови розміщенні на нашому дискорд сервері та піддаються змінам суспільстві"]},
        ]
    },
    {
        title: "ІГРОВИЙ ПРОЦЕС 4",
        src: "/images/axolotl.png",
        content: [
            {type: "paragraph", text: "На сервері діють особливі правила, які спрямовані на обмеження швидкості ігрової прогресії та шляхів її досягнення, а саме:"},
            {type: "unorderedlist", items: ["Вхід до Енду заборонений до 04.01.2026" , "Обмеження часу знаходження в Незері становить 20 хв*", "Усі інші умови розміщенні на нашому дискорд сервері та піддаються змінам суспільстві"]},
        ]
    },
    {
        title: "ІГРОВИЙ ПРОЦЕС 5",
        src: "/images/house.png",
        content: [
            {type: "paragraph", text: "На сервері діють особливі правила, які спрямовані на обмеження швидкості ігрової прогресії та шляхів її досягнення, а саме:"},
            {type: "unorderedlist", items: ["Вхід до Енду заборонений до 04.01.2026" , "Обмеження часу знаходження в Незері становить 20 хв*", "Усі інші умови розміщенні на нашому дискорд сервері та піддаються змінам суспільстві"]},
        ]
    },
    {
        title: "ІГРОВИЙ ПРОЦЕС 6",
        src: "/images/house.png",
        content: [
            {type: "paragraph", text: "На сервері діють особливі правила, які спрямовані на обмеження швидкості ігрової прогресії та шляхів її досягнення, а саме:"},
            {type: "unorderedlist", items: ["Вхід до Енду заборонений до 04.01.2026" , "Обмеження часу знаходження в Незері становить 20 хв*", "Усі інші умови розміщенні на нашому дискорд сервері та піддаються змінам суспільстві"]},
        ]
    },
    {
        title: "ІГРОВИЙ ПРОЦЕС 7",
        src: "/images/house.png",
        content: [
            {type: "paragraph", text: "На сервері діють особливі правила, які спрямовані на обмеження швидкості ігрової прогресії та шляхів її досягнення, а саме:"},
            {type: "unorderedlist", items: ["Вхід до Енду заборонений до 04.01.2026" , "Обмеження часу знаходження в Незері становить 20 хв*", "Усі інші умови розміщенні на нашому дискорд сервері та піддаються змінам суспільстві"]},
        ]
    },
    {
        title: "ІГРОВИЙ ПРОЦЕС 8",
        src: "/images/house.png",
        content: [
            {type: "paragraph", text: "На сервері діють особливі правила, які спрямовані на обмеження швидкості ігрової прогресії та шляхів її досягнення, а саме:"},
            {type: "unorderedlist", items: ["Вхід до Енду заборонений до 04.01.2026" , "Обмеження часу знаходження в Незері становить 20 хв*", "Усі інші умови розміщенні на нашому дискорд сервері та піддаються змінам суспільстві"]},
        ]
    },
    {
        title: "ІГРОВИЙ ПРОЦЕС 9",
        src: "/images/house.png",
        content: [
            {type: "paragraph", text: "На сервері діють особливі правила, які спрямовані на обмеження швидкості ігрової прогресії та шляхів її досягнення, а саме:"},
            {type: "unorderedlist", items: ["Вхід до Енду заборонений до 04.01.2026" , "Обмеження часу знаходження в Незері становить 20 хв*", "Усі інші умови розміщенні на нашому дискорд сервері та піддаються змінам суспільстві"]},
        ]
    },
]

export const data = {
    intro: {
        title: "ПРАВИЛА СЕРВЕРУ",
        description: ["Нижче Ви знайдете перелік правил серверу, які регулюють умови гри та норми поведінки гравців на сервері. Знання та розуміння правил є надзвичайно важливим для комфортной та приємноі гри на нашому сервері.", "Приєднуючись до серверу Ви автоматично погоджуєтесь з правилами, наведеними нижче."]
    },
    features: {
        title: "АКТУАЛЬНІСТЬ ПРАВИЛ",
        description: "Наведені нижче правила - це фундументальні постулати, на яких побудований наш сервер. Не зважаючи на це, актуальні правила Ви знайдете у нашій дискорд спільноті.",
        link: "/", // (!) куди веде кнопка приєднатись
    }
}